chcbaram/esp32-s3-lcd/main/common/hw/include/lcd/ili9481_regs.h
#ifndef ILI9481_REGS_H_
#define ILI9481_REGS_H_




#define ILI9481_C_NOP                 0x00
#define ILI9481_C_SOFT_RESET          0x01
#define ILI9481_C_ENTER_SLEEP_MODE    0x10
#define ILI9481_C_EXIT_SLEEP_MODE     0x11
#define ILI9481_C_ENTER_PARTIAL_MODE  0x12
#define ILI9481_C_ENTER_NORMAL_MODE   0x13
#define ILI9481_C_EXIT_INVERT_MODE    0x20
#define ILI9481_C_ENTER_INVERT_MODE   0x21
#define ILI9481_W_SET_GAMMA_CURVE     0x26
#define ILI9481_C_SET_DISPLAY_OFF     0x28
#define ILI9481_C_SET_DISPLAY_ON      0x29
#define ILI9481_W_SET_COLUMN_ADDR     0x2A
#define ILI9481_W_SET_PAGE_ADDR       0x2B
#define ILI9481_W_WRITE_MEMORY_START  0x2C
#define ILI9481_W_WRITE_LUT           0x2D
#define ILI9481_W_SET_PARTIAL_AREA    0x30
#define ILI9481_W_SET_SCROLL_AREA     0x33
#define ILI9481_C_SET_TEAR_OFF        0x34
#define ILI9481_W_SET_TEAR_ON         0x35
#define ILI9481_W_SET_ADDR_MODE       0x36
#define ILI9481_W_SET_SCROLL_START    0x37
#define ILI9481_C_EXIT_IDLE_MODE      0x38
#define ILI9481_C_ENTER_IDLE_MODE     0x39
#define ILI9481_W_SET_PIXEL_FORMAT    0x3A
#define ILI9481_W_WRITE_MEMORY_CONT   0x3C
#define ILI9481_W_SET_TEAR_SCANLINE   0x44
#define ILI9481_WR_CMD_ACC_PROTECT    0xB0
#define ILI9481_WR_LOW_POWER_MODE     0xB1
#define ILI9481_WR_FRAME_MEM_ACC_SET  0xB3
#define ILI9481_WR_DISP_MODE_FRAME_MEM_WR_MODE_SET   0xB4
#define ILI9481_WR_PANEL_DRIVING_SET      0xC0
#define ILI9481_WR_DISP_TIM_SET_NORMAL    0xC1
#define ILI9481_WR_DISP_TIM_SET_PARTIAL   0xC2
#define ILI9481_WR_DISP_TIM_SET_IDLE      0xC3
#define ILI9481_WR_FRAME_RATE_INV_CONTROL 0xC5
#define ILI9481_WR_INTERFACE_CONTROL      0xC6
#define ILI9481_WR_GAMMA_SET              0xC8
#define ILI9481_WR_POWER_SET              0xD0
#define ILI9481_WR_VCOM_CONTROL           0xD1
#define ILI9481_WR_PWOER_SET_FOR_NORMAL   0xD2
#define ILI9481_WR_PWOER_SET_FOR_PARTIAL  0xD3
#define ILI9481_WR_POWER_SET_FOR_IDLE     0xD4
#define ILI9481_WR_NV_MEM_WRITE           0xE0
#define ILI9481_WR_NV_MEM_CONTROL         0xE1
#define ILI9481_WR_NV_MEM_STATUS          0xE2
#define ILI9481_WR_NV_MEM_PROTECTION      0xE3






#endif